//***************************************************************************
//
//  Author(s)...: Pashgan    http://ChipEnable.Ru
//
//  Target(s)...: любой микроконтроллер
//
//  Compiler....: IAR EWA 5.11A
//
//  Description.: драйвер 4-ех кнопочного джойстика
//
//  Data........: 25.10.09
//
//***************************************************************************
#ifndef	BUTTONS_h
#define	BUTTONS_h

#include <avr/io.h>

//порт, к которому подключены кнопки
#define PORT_BUTTON 	PORTC
#define PIN_BUTTON 	  PINC
#define DDRX_BUTTON 	DDRC

//номера выводов, к которым подключены кнопки
#define BUTTON1 		2
#define BUTTON2 		3
#define BUTTON3		  4
#define BUTTON4 		5

//коды, которые будут записываться в буфер
#define KEY_NULL      0
#define KEY_1         1    /*BUTTON1*/
#define KEY_2         2    /*BUTTON2*/
#define KEY_3         3    /*BUTTON3*/
#define KEY_4         4    /*BUTTON4*/

//сколько циклов опроса кнопка должна удерживаться
#define THRESHOLD 5
/**************************************************************************
*   Function name : BUT_Init
*   Returns :       нет
*   Parameters :    нет
*   Purpose :       инициализация портов ввода/вывода
*                   вызывается обычно в начале main`a
****************************************************************************/
void BUT_Init(void);

/**************************************************************************
*   Function name : BUT_Debrief
*   Returns :       нет
*   Parameters :    нет
*   Purpose :       опрашивает кнопки. вызывается обычно из прерывания
*                   если кнопка нажата в течении 20 прерываний,
*                   ее номер записывается в буфер
****************************************************************************/
void BUT_Debrief(void);

/**************************************************************************
*   Function name : BUT_GetKey
*   Returns :       номер нажатой кнопки
*   Parameters :    нет
*   Purpose :       возвращает содержимое кнопочного буфера
*                   при этом буфер очищается
*                   вызывается обычно в main`e в цикле while
*
****************************************************************************/
unsigned char BUT_GetKey(void);


/**************************************************************************
*   Function name : BUT_Init
*   Returns :       нет
*   Parameters :    номер кнопки
*   Purpose :       записывает в кнопочный буфер значение
*                   требуется иногда для имитации нажатия кнопок
****************************************************************************/
void BUT_SetKey(unsigned char key);

#endif //BUTTONS_H
